var elemDescKeys=["SymStar101","SymStar102","SymStar103","SymStar104","SymStar105","SymStar106","SymStar107","SymStar109_1","SymStar110","SymStar111_1","SymStar112_1","SymStar113","SymStar116","SymStar117","SymStar118","SymStar119","SymStar120","SymStar121","SymStar122","SymStar123","SymStar127","SymStar191","SymStar192","SymStar193","SymStar201","SymStar202","SymStar203","SymStar204","SymStar205","SymStar206_1","SymStar207","SymStar208","SymStar209","SymStar209_1","SymStar210","SymStar211","SymStar212","SymStar213","SymStar216","SymStar217","SymStar219","SymStar221","SymStar223","SymStar301","SymStar302_1","SymStar303_1","SymStar304_1","SymStar305","SymStar307","SymStar308"];
var elemDescValues=
[
"Человек занимается самосовершенствованием, практикой, созиданием. Наделяет человека богатым духовным миром и способностью уходить в себя",
"Стимулирует стремление человека к власти и авторитету. Вспомогательная звезда,  усиливающая другиеСЗ вне зависимости от их благоприятности",
"Дух счастья, авторитета, познания мира. Ассоциируется со свободой, передвижениями, стремлением к прогрессу, обменом информацией и мудростью",
"Проблемы, скрытые в самом человеке, демон подсознательной неудачи",
"Потери и неудачи, приходящие к человеку извне. Демон Грабежа означает отсутствие шансов, внезапные препятствия",
"Сексуальность и харизматичность человека. Привлекает к себе интерес лиц другого пола и сам испытывает интерес к ним. Популярность, удововльствие",
"Звезда травм, ранений, бедствий, может принести очень много неприятностей и опасных ситуаций в жизни. Человеку следует остерегаться экстремальных видов спорта и профессий, связанных с риском для жизни и здоровья",
"Звезда брака, привлекательности и красоты, отвечает за романтическое знакомство, за привлечение партнеро",
"Звезда одиночества, ухода в самого себя, независимости, подозрительности и негармоничных отношений.",
"Звезда одиночества, ухода в самого себя, независимости, подозрительности и негармоничных отношений.",
"Символ депрессивности, несет психологические проблемы, страх, ужас, панику, беспокойство. Не влияет на богатств",
"Связана с отношениями, радостными, счастливыми событиями в жизни. Дает умение быть счастливым",
"Человек будет идти напролом и часто против закона. Велика вероятность оказаться в заключении, пострадать за свои поступки и дела",
"Опасность несчастных случаев, болезней и всевозможных травм. В периоды, в которых присутствует данная звезда, необходимо быть осторожным и внимательным",
"Вероятность получения травм. Если она приходит в периоде, то человеку необходимо избегать неоправданного риска и ни в коем случае не проявлять беспечность",
"Человеку сложно общаться с людьми. Часто могут возникать недопонимания, в результате чего велика вероятность ссор и разрыва взаимоотношений",
"Несчастные случаи, потеря благосостояния и даже полное разорение. Если она находится у человека в столпе месяца, то он может выбрать рискованную профессию",
"Свидетельствует о кармически заложенном богатстве и изобилии. Человек приходит в жизнь с могущественными покровителями, которые будут поддерживать его",
"Дает человеку доброту, великодушие, удачу, вдохновение, благополучие, процветание, счастье, указывает на возможную поддержку от сильных и влиятельных людей",
"Всевозможные трудности в жизни, болезни, травмы, потери имущества, смерть близких. Все зависит от того, в каком столпе стоит эта звезда. Она очень опасна! Если приходит в периоде, то необходимо быть очень аккуратным и бдительным, следить за своим здоровьем и близкими людьми",
"Звезда официальных бумаг. Несет проблемы с оформлением документов, путаницу, ошибки",
"Говорит об особых качествах внутренней гармонии. Наделяет человека обаянием, искренностью, щедростью, способствует признанию и успеху",
"Дает щедрость, искренность, богатство, репутацию и статус. Помогает осуществить любые намерения, получить помощь.",
"Управляет событиями, связанными с болезнями. Символизирует способности к медицине",
"Самый сильный Дух Удачи. Влиятельный человек, небесный помощник, усиливает все хорошее, приносит успех",
"Дает огромные жизненные силы, возможность преодолевать любые препятствия, обладать крепким здоровьем и иметь высокий материальный уровень",
"Дух удачи эстетики и культуры. Стимулирует интерес к обучению. Способствует сдаче экзаменов, вступлению в должность",
"Символизирует упрямство, нежелание признавать поражение и менять свое мнение. Может приносить повышенный травматизм",
"Заместитель Богатства в карте Бацзы. Звезда финансовой удачи, благополучия и процветания.",
"Демон розовых очков и напрасной надежды. Человек не принимает реальность,ему свойственно заблуждение и разочарование.",
"Аналог Почтовой Лошади. Символ богатства и знатности. Приносит высокий уровень жизни",
"Символизирует богатство, возможность стать состоятельным",
"Приносит простые житейские радости, не отвечает за богатство и известность",
"Потенциал для семейного счастья, выстраивания близких отношений с разными поколениями родственников",
"Связан с заботой, социальной защищенностью от невзгод внешнего мира. Отвечает за процветание, богатство человека.",
"Помощь в сложных жизненных ситуациях. В случаях возникновения проблем с законом приводит в жизнь влиятельных покровителей",
"Помогает оказаться в правильном месте и в правильное время. Убирает пустот",
"Несет простоту, порядочность, четкие моральные принципы, высокую нравственность. Чем скромнее человек, тем больше ему сопутствует удача",
"Несет ссоры, конфликты, несчастные случаи. Также она может означать судебные преследования и проблемы с законом",
"Соблюдение правил и законов общества, отвечает за карьеру и авторитет",
"Дает утонченное восприятие жизни, способствует постоянному совершенствованию личност",
"Приносит в жизнь человека материальный успех и процветание",
"Дополнительный Цветок Персика, увеличивает шанс романтичных отношений или заключения брак",
"Отсутствие результата в любых действиях, иллюзии, заблуждения",
"Приносит неверные финансовые решения.Сложность делать накопления и удержать заработанное",
"Приносит беспорядок в личные отношения. Указывает на сложности при внешне благополучном брак",
"Символизирует склонность к одинокому образу жизни и трудности в заключении брака",
"Звезда стремления человека к власти, вплоть до авторитаризма, упрямства, агрессивности и жестокости",
"Звезда даёт человеку красоту, привлекательность, обаяние, но обделяет скромностью и подвергает искушениям, из-за которых человек может вести распущенный образ жизни",
"Звезда процветания, богатства и долголетия. Увеличивает шанс достичь больших высот в материальном и карьерном плане"
];
function getDescription(key) {
	return "<i>"+elemDescValues[elemDescKeys.indexOf(key)]+"</i>";
}

$("#iframe").on("load", () => {	
	var $head = $("#iframe").contents().find("head");

	$head.append($("<link/>", {
		rel: "stylesheet",
		href: "./bazi for svetlana sharnova_files/style.css",
		type: "text/css"
	}));
});
