<template>
  <div>
    <section class="free">
      <p class="title">
        Калькуляторы
      </p>
      <CalcBlock calc="Bazi" title="Китайский календарь (Ба Цзы и Альманах)" description="Выбор дня — это выбор удачи. Выбор удачи — это своего рода усилие, прилагаемое людьми для использования благоприятных условий. Выбор благоприятного дня может сыграть определенную роль для вашего события, а так же повлиять на скорость вашего результата.<br/><br/><em>Введите в калькуляторе дату рождения и узнайте свой<br>элемент личности!</em>" />
      <CalcBlock class="margin120" calc="Ruler" title="Линейка Фэн-шуй для определения благоприятности размеров предметов" description="Фэн-шуй — это китайская философская система гармонизации каждого человека с окружающей средой. Согласно этому каждый объект с определенными размерами и в определенном месте будет излучать гармоническую энергию.<br><br>Линейка Фен-шуй используется для измерения размеров дверей, дверей спален, кухонных дверей, стола, мебели, кроватей и шкафов." />
      <Pro />
      <CalcBlock class="margin120" calc="GuaPeople" title="Калькулятор Гуа (человека) с описаниями качеств направлений сторон света" description="Гуа — это китайский религиозный мотив, включающий восемь триграмм И Цзин, расположенных восьмиугольно вокруг символа, обозначающего баланс Инь и ян.<br><br>Введите пол и год рождения, чтобы определить свои счастливые звездные аспекты для внесения благоприятных изменений в Фэн-шуй." />
      <CalcBlock class="margin120" calc="GuaHouse" title="Калькулятор Гуа (дома) с описаниями качеств направлений сторон света" description="Гуа — это китайский религиозный мотив, включающий восемь триграмм И Цзин, расположенных восьмиугольно вокруг символа, обозначающего баланс Инь и ян.<br><br>Числа Фэн-шуй применимы как к дому, так и к людям, живущим в нем. Его цель — найти лучшую энергию Ци в доме для каждого человека, расположения кровати, направления входной двери и расположения рабочего стола." />
      <CalcBlock class="margin120" calc="GuaPeople" title="Калькулятор Ци Мэнь Дунь Цзя для расчета часовых раскладов цимень" description="Qi Men Dun Jia 奇門遁甲 — является древним китайским инструментом метафизики, используемым для прогнозирования результатов и выявления скрытых причин и следствий, что позволяет осуществлять стратегическое исполнение или решать различные задачи. Ключевая сила Qi Men Dun Jia заключается в анализе энергии текущего пространства и времени. Поместив человека в наиболее перспективную точку в нужное время и в нужном направлении, можно в конечном итоге получить наилучшие результаты для достижения своих целей." />
    </section>
    <Email />
  </div>
</template>

<script>
import { useStore, computed, useMeta, defineComponent } from '@nuxtjs/composition-api'
export default defineComponent({
  setup () {
    const store = useStore()
    store.dispatch('CheckAuth')
    const auth = computed(() => store.getters.isAuth)
    const access = computed(() => store.getters.isAccess)

    useMeta({
      title: 'Калькулятры'
    })

    return { auth, access }
  },
  head: {}
})
</script>

<style lang="scss" scoped>
.free {
  .title {
    font-family: 'Lato';
    font-style: normal;
    font-weight: 600;
    font-size: 90px;
    line-height: 115%;
    letter-spacing: 0.01em;
    text-transform: uppercase;
    color: #000000;

    margin-bottom: 100px;
  }

  .margin120 {
    margin-top: 120px;
  }
}
@media (max-width: 1200px) {
  .free {
    .title {
      font-size: 8.205128205128204vw;

      margin-bottom: 40px;
    }

    .margin120 {
      margin-top: 100px;
    }
  }
}
</style>
